const Homepage = () => {
    return (
        <div className="content">
            <h1>Добро пожаловать!</h1>
            <p>
                Это — проект-библиотека фанфиков. Основная задача данного сайта - создать 
                сплоченное сообщество начинающих авторов и ещё одну библиотеку для хранения и архивирования фан фикшена. Хотя
                на самом деле это просто проба пера в построении сайта на основе подобия API сервера на нативном php, и если вы 
                видите этот сайт, то что вы тут забыли?
            </p>
            <p>
                На данный момент сайт находится в разработке и многого заранее представленного функционала пока что нет. Но вы
                можете путешествовать по тому, что есть на данный момент, и запомнить как все было)) Также могут быть баги, просьба
                не писать мне что я криворукий кодер (я и сам это знаю) !!!
            </p>
            <p>
                Проект постоянно развивается, фандомов много, персонажей - ещё больше!!! Поэтому, команда сайта
                нуждается в людях, готовых помогать расширять базу данных сайта. По вопросам сотрудничества пишите в 
                техподдержку
            </p>
            <p className="Copyright"> — Анонимный автор сия библиотека</p>
        </div>
    )
}

export {Homepage}